Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.IFCConfigurationUpgradeService
The service which performs IFC configuration upgrades during document open.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.GeometryAugmentationService
Autodesk Internal: The service where GeometryAugmentationServers can be registered.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.GeolocationServices
Autodesk  Internal: The unique id for working with geolocation services

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.FormaOperationService
The service which permits registration of an external server for operations of FCC.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ExtendedPropertiesUIService
The external UI service which permits registration of an alternate servers for new UI of link extended properties